docs/posts/2008-11-18-the-monty-hall-problem.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 30, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The Monty Hall Problem</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/normalize.css' type='text/css'/>
<link rel='stylesheet' href='/css/main.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/">Home</a></li>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/tags/">Tags</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">The Monty Hall Problem</h1>
<p class="subtitle" role="doc-subtitle">Nov 18, 2008</p>
</header><p>
One of the assignments in Critical Thinking was to figure the probability of winning the prize in the traditional three-door Monty Hall problem. Remember that there are three doors for you, the contestant, to choose from, but only one has the prize. The host knows what door the prize is behind, and opens another door to show you that there is nothing there. He will open neither the one you pick nor the one that has the prize. Let’s say that you pick Door 1, and Monty opens Door 2. What’s the probability that the prize is behind Door 3? From class, you know the answer is 2/3.
</p>

<p>
What’s important is that the host knows where the prize is. If he doesn’t know, then the probability is 1/2. You can calculate this using Bayes’ Theorem. Try it out!
</p>

<p>
By the way, if you can remember “1/2” then you should be able to get some extra-credit points on tomorrow’s exam. Even more points if you can do the calculation&#x2026;.
</p>



<div class="tagline" id="orgc0d1bd9">
<p>
Tagged: <a href="../tags/critical-thinking.html">Critical-Thinking</a>
</p>

</div>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 30, 2024.<br>
  Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
